src/cf/Enums/ЭтапыОбработкиПредметов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЭтапыОбработкиПредметов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗапроситьМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнитьПротокол</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнитьПунктПротокола</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОзнакомитьСМатериалами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьПротокол</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПровестиМероприятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьПротокол</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвердитьПрограмму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвердитьПротокол</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыДействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ознакомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ЭтапыОбработкиПредметов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТипДействия") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		Если ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеМероприятиями") Тогда
			
			Если Параметры.ТипДействия = Перечисления.ТипыДействий.Исполнение Тогда
				
				ДанныеВыбора.Добавить(ЗапроситьМатериалы);
				ДанныеВыбора.Добавить(ИсполнитьПротокол);
				ДанныеВыбора.Добавить(ПодготовитьПротокол);
				ДанныеВыбора.Добавить(ПровестиМероприятие);
				
			ИначеЕсли Параметры.ТипДействия = Перечисления.ТипыДействий.Ознакомление Тогда
				
				ДанныеВыбора.Добавить(ОзнакомитьСМатериалами);
				
			ИначеЕсли Параметры.ТипДействия = Перечисления.ТипыДействий.Согласование Тогда
				
				ДанныеВыбора.Добавить(СогласоватьПротокол);
				
			ИначеЕсли Параметры.ТипДействия = Перечисления.ТипыДействий.Утверждение Тогда
				
				ДанныеВыбора.Добавить(УтвердитьПрограмму);
				ДанныеВыбора.Добавить(УтвердитьПротокол);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
